/* ΔΟΜΕΣ ΔΕΔΟΜΕΝΩΝ 2016-17
 * DS - CANDY CRUSH
 * 
 * ΕΥΡΙΠΙΔΗΣ ΜΠΑΛΤΖΗΣ
 * ΑΕΜ: 8196
 * ΤΗΛ: 6980727893
 * e-mail; evrimpal@ece.auth.gr
 * 
 * ΒΑΣΙΛΗΣ ΜΠΕΛΛΟΣ
 * ΑΕΜ: 8715
 * ΤΗΛ: 6947998401
 * e-mail: v8.bellos@gmail.com
 */
package gr.auth.ee.dsproject.crush.board;

// κλάση για τη δημιουργία των πλακιδίων του ταμπλό 
public class Tile
{

  protected int id;							 // ταυτότητα πλακιδίου (προστατευμένη μεταβλητή)			
  private int x;							 //	τετμημένη πλακιδίου (ιδιωτική μεταβλητή)
  private int y;							 // τεταγμένη πλακιδίου (ιδιωτική μεταβλητή)
  private int color;						 // χρώμα πλακιδίου (ιδιωτική μεταβλητή)
  private boolean mark;						 // λογική τιμή για επιλογή του πλακιδίου για διαγραφή στην επόμενη κίνηση (ιδιωτική μεταβλητή)

  /* συνάρτηση - constructor που δέχεται ως ορίσματα τις ακέραιες τιμές 
   * idTile, xTile, yTile, colorTile καθώς και τη λογική τιμή markTile
   * και τις περνά στις αντίστοιχες μεταβλητές ταυτότητας, τετμημένης, 
   * τεταγμένης, χρώματος και επιλογής πλακιδίου προς διαγραφή στην επόμενη κίνηση
   */
  public Tile(int idTile, int xTile, int yTile, int colorTile, boolean markTile){
  	id = idTile;
  	x = xTile;
  	y = yTile;
  	color = colorTile;
  	mark = markTile;	
  }
  
  //συνάρτηση που επιστρέφει την τιμή της ταυτότητας του πλακιδίου
  public int getId(){
  	return id;
  }
  
  /* συνάρτηση που δέχεται ως όρισμα μια ακέραια τιμή και την περνά
   * στην αντίσοτιχη μεταβλήτή ταυτότητας του πλακιδίου
   */
  public void setId(int idTile){
  	id = idTile;
  }
  
  //συνάρτηση που επιστρέφει την τιμή της τετμημένης του πλακιδίου
  public int getX(){
  	return x;
  }
  
  /* συνάρτηση που δέχεται ως όρισμα μια ακέραια τιμή και την περνά
   * στην αντίσοτιχη μεταβλήτή τετμημένης του πλακιδίου
   */
  public void setX(int xTile){
 	x = xTile;
  }
  
  //συνάρτηση που επιστρέφει την τιμή της τεταγμένης του πλακιδίου
  public int getY(){
  	return y;
  }
  
  /* συνάρτηση που δέχεται ως όρισμα μια ακέραια τιμή και την περνά
   * στην αντίσοτιχη μεταβλήτή τεταγμένης του πλακιδίου
   */
  public void setY(int yTile){
  	y = yTile;
  }
  
  //συνάρτηση που επιστρέφει την τιμή του χρώματος του πλακιδίου
  public int getColor(){
  	return color;
  }
  
  /* συνάρτηση που δέχεται ως όρισμα μια ακέραια τιμή και την περνά
   * στην αντίσοτιχη μεταβλήτή χρώματος του πλακιδίου
   */
  public void setColor(int colorTile){
  	color = colorTile;
  }
  
  //συνάρτηση που επιστρέφει την τιμή της λογικής μεταβλητής mark του πλακιδίου
  public boolean getMark(){
  	return mark;
  }
  
  /* συνάρτηση που δέχεται ως όρισμα μια λογική τιμή και την περνά
   * στην αντίσοτιχη μεταβλήτή για επιλογή του πλακιδίου για διαγραφή
   * στην επόμενη κίνηση
   */
  public void setMark(boolean markTile){
  	mark = markTile;
  }
}